emacs/config.org
#+title: Doom emacs config
#+author: Marshall Bruner
#+property: header-args :tangle config.el

* Table of contents :toc:
- [[#package-management][Package Management]]
- [[#personal-info][Personal Info]]
- [[#theme][Theme]]
- [[#org-mode][Org-mode]]
  - [[#base-org-mode-and-packages][Base org-mode and packages]]
  - [[#org-roam][Org-Roam]]
- [[#editor][Editor]]
- [[#extra-functions][Extra functions]]
- [[#keybindings][Keybindings]]

* Package Management
#+BEGIN_SRC emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
#+END_SRC

* Personal Info
Some personal information...
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Marshall Bruner"
      user-mail-address "brunerm99@gmail.com")
#+END_SRC

* Theme
Fonts, theme, etc. goes here.
#+BEGIN_SRC emacs-lisp
;;(setq doom-font (font-spec :family "Fira Code" :size 12 :weight 'semi-light)
;;      doom-variable-pitch-font (font-spec :family "Fira Sans" :size 13))

(setq doom-theme 'doom-one)

(setq display-line-numbers-type t)
#+END_SRC

* Org-mode
** Base org-mode and packages
#+BEGIN_SRC emacs-lisp
(after! org
        (setq org-directory "~/.org-roam/")
        (setq org-todo-keywords '((sequence "TODO(t)" "PROJ(p)" "IP(i)" "IDEA(a)"
                                            "MAYBE(m)" "|" "DONE(d)" "CANCELLED(c)" )))
        (setq org-log-done 'time)

        (require 'ob-ipython)
        (org-babel-do-load-languages 'org-babel-load-languages
                                     '(
                                       (python . t)
                                       (ipython . t)
                                       (sh . t)))
        (setq ob-async-no-async-languages-alist '("ipython"))
  )
#+END_SRC

** Org-Roam
#+BEGIN_SRC emacs-lisp
;; (make-directory "~/.org-roam")
(add-to-list 'load-path "~/.gitclones/org-roam")
(require 'org-roam)
(setq org-roam-directory (file-truename "~/.org-roam"))

;; Allow symbolic links
(setq find-file-visit-truename t)

;; Autosync
(org-roam-db-autosync-mode)

(setq org-roam-completion-everywhere t)

#+END_SRC

* Editor
#+BEGIN_SRC emacs-lisp
;; Allows multiple cursor editing with evil bindings
(require 'evil-multiedit)
(evil-multiedit-default-keybinds)
#+END_SRC

* Extra functions
#+begin_src emacs-lisp
;; Create function to insert ipython source block
(defun insert-ipython-src-block ()
  (interactive)
  (insert "#+BEGIN_SRC ipython :session ipyenv :results raw drawer\n\n#+END_SRC"))
#+end_src

* Keybindings
#+begin_src emacs-lisp
;; Leader mappings
(map! :leader
      (:prefix ("m L" . "blocks")
       :desc "Insert ipython code block with session" "i" #'insert-ipython-src-block
       )
      (:desc "Find org-roam node" "f o" #'org-roam-node-find)
      (:desc "Insert org-roam node" "f O" #'org-roam-node-insert))
#+end_src
